docs/history-of-computing/reading00/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Reading 00: Traditional Board Games and Modern Video Games</title>
    <meta charset="utf-8" />
    <meta name="author" content="Conrad Bailey" />
    <meta name="description" content="Response to Reading 00 https://www3.nd.edu/~pbui/teaching/cse.40850.sp18/reading00.html" />
    <link rel="stylesheet" href="https://conradbailey.github.io/org-site-demo/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="https://conradbailey.github.io/org-site-demo/media/css/prettify.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="https://conradbailey.github.io/org-site-demo">Conrad Bailey</a></h1>
        <p></p>
        <ul>
          <li><a href="https://conradbailey.github.io/org-site-demo/blog">Blog</a></li>
          <li><a href="https://conradbailey.github.io/org-site-demo/history-of-computing">History of Computing</a></li>
          <li><a href="https://conradbailey.github.io/org-site-demo/about">About</a></li>
        </ul>
      </header>
    </div>

<div>
<div class="post">
<h1>Reading 00: Traditional Board Games and Modern Video Games</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Competition: The Common Origin</h2>
<div class="outline-text-2" id="text-1">
<p>
My family never really played board games. My dad refused to play
Battleship with my mother because she would play purely by intuition,
erratic, seemingly at random, but she always won and it infuriated
him. We played a couple games of Clue, but my sister hated the process
of logical deduction necessary to compete, so she'd rage quit. My mom
used to love Tetris until it came to light I was even more competitive
than her and she couldn't keep up with my high scores. I practiced
playing foosball on my own to get competitive with my dad; when my new
skills proved very effective my dad flipped the whole table. I would
rage quit every trivia game as a kid because I didn't stand a chance
against my parents. The only game we ever played more than a handful
of times was Sorry; an absolute excuse of a game that needs little to
no skill or strategy.
</p>

<p>
So the most prevalent relationship between board games and video games
in my experience has been their common inspiration for rage
quitting. That compulsion is born from fierce competition. Most humans
have some compulsion for competition that's expressed through sport or
skill. But those expressions require some initial training before you
can participate in them, like learning an instrument or being taught
to throw and catch.
</p>

<p>
I think games often bridge this accessibility gap. Often the rules
of a game can be understood in a few minutes, and playing can
begin. Players can jump immediately into strategizing. A sport
strategies fall apart if a player lacks the physical capabilities
necessary to execute them, but a game allows any strategy to be
immediately executed. There is no prerequisite ability in playing
cards, rolling dice, pressing buttons, or moving joysticks. You
don't need to be tall, fast, or strong to play or even enjoy
Monopoly or Mario; you only need your hands.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Physical and Digital</h2>
<div class="outline-text-2" id="text-2">
<p>
There are very few board games that cannot be implemented digitally,
and those that come to mind, like Twister, only loosely resemble
board games. So in this sense video games are a natural evolution of
the board game. Digitalization allows for games that are massive in
scale and distribution. The computer is the ultimate game master:
unbiased and instant. Computing graduates games from static to
dynamic. They can immerse the player in ways no board game can:
light, sound, and narrative. And players can be passively immersed;
board games that attempt to immerse, like Dungeons and Dragons,
require a lot from a player's imagination to hook them.
</p>

<p>
But video games may struggle to inspire nostalgia the way a board
game can. People generally don't pass save data down to their
children, but it's not uncommon for a chess board to be decades
old. Who hasn't improvised some missing game piece with a funny
knick-knack? And there's something to be said for proximity. Board
games generally require the players to share there space and time
with eachother, to connect directly. Early video game multiplayer
experiences came close to this, and a generation of players has
incredible nostalgia concerning this dynamic. But with the ever
rising popularity of networked gaming the multiplayer experience
takes players farther and farther away. Even if they're in the same
room rarely do they share the same screen. And I think that's partly
why a resurgence in table-top gaming has occurred. The intimacy of
that interaction is satisfying. There's a vivid shared experience
amongst the players; you feel like a part of something permanent,
the memory of it. Video games can be played at any time, anywhere,
and this may give them a transient quality.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">The Similarities</h2>
<div class="outline-text-2" id="text-3">
<p>
For all their differences, board games and video games are designed
to be played. People play them to pass the time, to go on an
adventure, or to test their mettle. They must engage the player and
convince them that playing the game is worth their time. The player
expects reward for their struggles, and creativity in those
struggles. The player doesn't want to be patronized, but they'll be
frustrated by unreasonable difficulty. They expect to be treated
fairly by the game. Enjoyment is not directly related to simplicity
or complexity; both have their place. These qualities are necessary
for a good game, of any kind, because a good game is a vehicle for
human struggle and reward; where the latter may not follow the
former in our real lives, we expect games to reliably provide this
dynamic in a format that we find palatable. That is their purpose.
</p>
</div>
</div>

</div>
</div>
      <div class="footer">
        <p>
          Site by - <a href="mailto:conrad@cbailey.tech">Conrad Bailey</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/ConradBailey/org-site" target="_blank">org-site</a>
        </p>
      </div>
    </div>

  </body>
</html>
